# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalPanel..::..Create Method
AnalyticalPanel Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, CurveLoop) | Creates a new instance of an Analytical Panel within the project. |
| Create(Document, Curve, XYZ) | Creates a new instance of an Analytical Panel within the project. |

# See Also
AnalyticalPanel Class
AnalyticalPanel Members
Autodesk.Revit.DB.Structure Namespace